app/Controllers/DashboardController.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard',
            'responden' => $this->responden->countAllResults(),
            'users' => $this->user->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_responden`
SELECT COUNT(*) AS `numrows`
FROM `tbl_user`