app/Controllers/HomeController.php

SELECT *
FROM `tbl_produk`
---
    public function index()
    {
        $data = [
            'title' => 'Home',
            'products' => $this->produk->findAll()