app/Controllers/RespondenController.php

    public function show()
    {
        if ($this->request->getGet('from')) {
            $responden = $this->responden->filterDate($this->request->getGet('from'));
            if ($this->request->getGet('to')) {
                $responden = $this->responden->filterDate($this->request->getGet('from'), $this->request->getGet('to'));
            }
        } else {
            $responden = $this->responden->findAll();
---
SELECT *
FROM `tbl_responden`